# Написать программу вычисления значения функции y = f(a)

from math import *
def func (x):
    y = sin(x) / x
    return(y)
print(func(1))