# Вывести квадрат числа

def show_square (n):
    return n*n

print('Введите число: ')
n = int(input())
print(show_square(n))